In [9]:
import pandas as pd  
import numpy as np

In [3]:
s=pd.Series(range(5), index=["e","d","a","b","c"])
s

e    0
d    1
a    2
b    3
c    4
dtype: int64

In [11]:
s.sort_index()

a    2
b    3
c    4
d    1
e    0
dtype: int64

In [13]:
df=pd.DataFrame(np.arange(12).reshape(3,4),index=["iki","bir","uc"],
                columns=["d","a","b","c"])
df

     d  a   b   c
iki  0  1   2   3
bir  4  5   6   7
uc   8  9  10  11

In [15]:
df.sort_index()

     d  a   b   c
bir  4  5   6   7
iki  0  1   2   3
uc   8  9  10  11

In [16]:
df.sort_index(axis=1)

     a   b   c  d
iki  1   2   3  0
bir  5   6   7  4
uc   9  10  11  8

In [17]:
df.sort_index(axis=1,ascending=False)

     d   c   b  a
iki  0   3   2  1
bir  4   7   6  5
uc   8  11  10  9

In [18]:
s

e    0
d    1
a    2
b    3
c    4
dtype: int64

In [19]:
s.sort_values()

e    0
d    1
a    2
b    3
c    4
dtype: int64

In [20]:
df

     d  a   b   c
iki  0  1   2   3
bir  4  5   6   7
uc   8  9  10  11

In [21]:
df2=pd.DataFrame({"a":[5,3,-1,9],"b":[1,-2,0,5]})
df2

   a  b
0  5  1
1  3 -2
2 -1  0
3  9  5

In [22]:
df2.sort_values(by="b")

   a  b
1  3 -2
2 -1  0
0  5  1
3  9  5

In [23]:
df2.sort_values(by=["b","a"])

   a  b
1  3 -2
2 -1  0
0  5  1
3  9  5

In [28]:
veri=pd.read_csv("vgsalesGlobale.csv")

veri.head()

In [29]:
veri.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [30]:
type(veri)

pandas.core.frame.DataFrame

In [39]:
veri["Name"].sort_values()

4754                                 '98 Koshien
8357                  .hack//G.U. Vol.1//Rebirth
7107                .hack//G.U. Vol.2//Reminisce
8602     .hack//G.U. Vol.2//Reminisce (jp sales)
8304               .hack//G.U. Vol.3//Redemption
                          ...
627                                 uDraw Studio
7835                uDraw Studio: Instant Artist
15523               uDraw Studio: Instant Artist
470                   wwe Smackdown vs. Raw 2006
9135                ¡Shin Chan Flipa en colores!
Name: Name, Length: 16598, dtype: object

In [40]:
    veri["Name"].sort_values(ascending=False)

9135                ¡Shin Chan Flipa en colores!
470                   wwe Smackdown vs. Raw 2006
15523               uDraw Studio: Instant Artist
7835                uDraw Studio: Instant Artist
627                                 uDraw Studio
                          ...
8304               .hack//G.U. Vol.3//Redemption
8602     .hack//G.U. Vol.2//Reminisce (jp sales)
7107                .hack//G.U. Vol.2//Reminisce
8357                  .hack//G.U. Vol.1//Rebirth
4754                                 '98 Koshien
Name: Name, Length: 16598, dtype: object

In [42]:
veri.sort_values(["Year","Name"])

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
258,259,Asteroids,2600,1980.0,Shooter,Atari,4.00,0.26,0.00,0.05,4.31
2669,2671,Boxing,2600,1980.0,Fighting,Activision,0.72,0.04,0.00,0.01,0.77
6317,6319,Bridge,2600,1980.0,Misc,Activision,0.25,0.02,0.00,0.00,0.27
6896,6898,Checkers,2600,1980.0,Misc,Atari,0.22,0.01,0.00,0.00,0.24
1969,1971,Defender,2600,1980.0,Misc,Atari,0.99,0.05,0.00,0.01,1.05
...,...,...,...,...,...,...,...,...,...,...,...
7351,7353,Yu Yu Hakusho: Dark Tournament,PS2,NaN,Fighting,NaN,0.10,0.08,0.00,0.03,0.21
15476,15479,Yu-Gi-Oh! 5D's Wheelie Breakers (JP sales),Wii,NaN,Racing,Unknown,0.00,0.00,0.02,0.00,0.02
11409,11411,Zero: Tsukihami no Kamen,Wii,NaN,Action,Nintendo,0.00,0.00,0.08,0.00,0.08
8899,8901,eJay Clubworld,PS2,NaN,Misc,Empire Interactive,0.07,0.06,0.00,0.02,0.15
470,471,wwe Smackdown vs. Raw 2006,PS2,NaN,Fighting,NaN,1.57,1.02,0.00,0.41,3.00